html/physics/climate/effective-temperature.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-04 Sun 18:15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Effective Temperature</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Effective Temperature</h1>

<div id="outline-container-org6900041" class="outline-2">
<h2 id="org6900041"><span class="section-number-2">1</span> Problem</h2>
<div class="outline-text-2" id="text-1">
<p>
Given the Sun acts like a black body radiating at a constant luminosity,
determine the effective temperature of the Earth. Assume the Earth has
no atmosphere.
</p>
</div>
</div>

<div id="outline-container-org605557c" class="outline-2">
<h2 id="org605557c"><span class="section-number-2">2</span> Overview</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0b6660d" class="outline-3">
<h3 id="org0b6660d"><span class="section-number-3">2.1</span> Computing the Approximate Temperature of the Earth</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>Identify</b>. We use the Stefan&#x2013;Boltzmann law for the Sun's luminosity,
then considering the Irradiance of the Earth receiving this radiation,
we assume the Earth is in a steady state&#x2026;so its luminosity (from the
Stefan&#x2013;Boltzmann law) of radiation emitted equals its irradiance
received from the Sun.
</p>

<p>
<b>Setup and Execute.</b> We use the Stefan&#x2013;Boltzmann law for black-body
temperature, the Luminosity of the sun is then stipulated to be:
</p>

\begin{equation}
L_{\odot} = 4\pi R_{\odot}^{2}\sigma T_{\odot}^{4}.
\end{equation}

<p>
The Earth is a distance \(a_{0}\) from the Sun, the irradiance received by
a single point at this distance would be
</p>

\begin{equation}
E_{\oplus} = \frac{L_{\odot}}{4\pi a_{0}^{2}}.
\end{equation}

<p>
The radiance flux absorbed by the Earth would be given by treating the
Earth as a disc ("broadside of a barn") which is hit by the Sun's rays.
That is to say, integrating the irradiance by the cross-sectional area
of the Earth, or
</p>

\begin{equation}
\Phi_{abs} = \pi R_{\oplus}^{2}E_{\oplus}.
\end{equation}

<p>
In a steady state, the Luminosity emitted by the Earth is equal to the irradiance
received, giving us
</p>

\begin{equation}
4\pi R_{\oplus}^{2}\sigma T_{\oplus}^{4} = \pi R_{\oplus}^{2}E_{\oplus}.
\end{equation}

<p>
We substitute in the value of \(E_{\oplus}\) to the right-hand side,
giving us
</p>

\begin{equation}
4\pi R_{\oplus}^{2}\sigma T_{\oplus}^{4} = \pi R_{\oplus}^{2}\frac{L_{\odot}}{4\pi a_{0}^{2}}.
\end{equation}

<p>
The luminosity of the Sun transforms the right-hand side into
</p>

\begin{equation}
4\pi R_{\oplus}^{2}\sigma T_{\oplus}^{4} = \pi R_{\oplus}^{2}\frac{4\pi R_{\odot}^{2}\sigma T_{\odot}^{4}}{4\pi a_{0}^{2}}.
\end{equation}

<p>
Now we solve for the temperature of the Earth \(T_{\oplus}\)
</p>

\begin{equation}
T_{\oplus}^{4} = \frac{R_{\odot}^{2}T_{\odot}^{4}}{4a_{0}^{2}}
\end{equation}

<p>
which simplifies to
</p>

\begin{equation}
T_{\oplus} = T_{\odot}\sqrt{\frac{R_{\odot}}{2a_{0}}}.
\end{equation}

<p>
We can plug in empirical values for these quantities to get an estimate
for the temperature of the Earth.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">let</span> ((sun-temperature 5772.0) <span class="org-comment-delimiter">;; </span><span class="org-comment">K</span>
      (sun-radius 695700.0) <span class="org-comment-delimiter">;; </span><span class="org-comment">km</span>
      (earth-distance 149596000.0)) <span class="org-comment-delimiter">;; </span><span class="org-comment">km</span>
  (* sun-temperature (sqrt (/ sun-radius (* 2.0 earth-distance)))))
</pre>
</div>

<pre class="example">
278.3314843147163
</pre>


<p>
Thus the temperature of the Earth \(T_{\odot}\approx 278\mbox{ K}\) or
about 5 degrees Celsius on the surface of the Earth, assuming the Earth
absorbs all of the Sun's rays and the Earth has no atmosphere.
</p>

<p>
<b>Evaluate.</b> Does this make sense? Well, as the distance of the Earth
increases \(a_{0}\to\infty\) we see the surface temperature for the Earth
decreases \(T_{\oplus}\to0\), as we would expect. Similarly, for
decreasing the radius of the Sun \(R_{\odot}\to0\), we see the Earth
would receive decreasing radiance hence decreasing temperature
\(T_{\oplus}\to0\), as we would expect.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-03-20 Sat 12:23.</p>
</div>
</body>
</html>